GopalSaraf/Practicals/PSDL/include/proc/pic18f66j94.inc
// Register: RPOR6_7
#define RPOR6_7 RPOR6_7
RPOR6_7                                  equ 0E15h
// bitfield definitions
RPOR6_7_RPO6R_POSN                       equ 0000h
RPOR6_7_RPO6R_POSITION                   equ 0000h
RPOR6_7_RPO6R_SIZE                       equ 0004h
RPOR6_7_RPO6R_LENGTH                     equ 0004h
RPOR6_7_RPO6R_MASK                       equ 000Fh
RPOR6_7_RPO7R_POSN                       equ 0004h
RPOR6_7_RPO7R_POSITION                   equ 0004h
RPOR6_7_RPO7R_SIZE                       equ 0004h
RPOR6_7_RPO7R_LENGTH                     equ 0004h
RPOR6_7_RPO7R_MASK                       equ 00F0h
RPOR6_7_RPO6R0_POSN                      equ 0000h
RPOR6_7_RPO6R0_POSITION                  equ 0000h
RPOR6_7_RPO6R0_SIZE                      equ 0001h
RPOR6_7_RPO6R0_LENGTH                    equ 0001h
RPOR6_7_RPO6R0_MASK                      equ 0001h
RPOR6_7_RPO6R1_POSN                      equ 0001h
RPOR6_7_RPO6R1_POSITION                  equ 0001h
RPOR6_7_RPO6R1_SIZE                      equ 0001h
RPOR6_7_RPO6R1_LENGTH                    equ 0001h
RPOR6_7_RPO6R1_MASK                      equ 0002h
RPOR6_7_RPO6R2_POSN                      equ 0002h
RPOR6_7_RPO6R2_POSITION                  equ 0002h
RPOR6_7_RPO6R2_SIZE                      equ 0001h
RPOR6_7_RPO6R2_LENGTH                    equ 0001h
RPOR6_7_RPO6R2_MASK                      equ 0004h
RPOR6_7_RPO6R3_POSN                      equ 0003h
RPOR6_7_RPO6R3_POSITION                  equ 0003h
RPOR6_7_RPO6R3_SIZE                      equ 0001h
RPOR6_7_RPO6R3_LENGTH                    equ 0001h
RPOR6_7_RPO6R3_MASK                      equ 0008h
RPOR6_7_RPO7R0_POSN                      equ 0004h
RPOR6_7_RPO7R0_POSITION                  equ 0004h
RPOR6_7_RPO7R0_SIZE                      equ 0001h
RPOR6_7_RPO7R0_LENGTH                    equ 0001h
RPOR6_7_RPO7R0_MASK                      equ 0010h
RPOR6_7_RPO7R1_POSN                      equ 0005h
RPOR6_7_RPO7R1_POSITION                  equ 0005h
RPOR6_7_RPO7R1_SIZE                      equ 0001h
RPOR6_7_RPO7R1_LENGTH                    equ 0001h
RPOR6_7_RPO7R1_MASK                      equ 0020h
RPOR6_7_RPO7R2_POSN                      equ 0006h
RPOR6_7_RPO7R2_POSITION                  equ 0006h
RPOR6_7_RPO7R2_SIZE                      equ 0001h
RPOR6_7_RPO7R2_LENGTH                    equ 0001h
RPOR6_7_RPO7R2_MASK                      equ 0040h
RPOR6_7_RPO7R3_POSN                      equ 0007h
RPOR6_7_RPO7R3_POSITION                  equ 0007h
RPOR6_7_RPO7R3_SIZE                      equ 0001h
RPOR6_7_RPO7R3_LENGTH                    equ 0001h
RPOR6_7_RPO7R3_MASK                      equ 0080h

// Register: RPOR8_9
#define RPOR8_9 RPOR8_9
RPOR8_9                                  equ 0E16h
// bitfield definitions
RPOR8_9_RPO8R_POSN                       equ 0000h
RPOR8_9_RPO8R_POSITION                   equ 0000h
RPOR8_9_RPO8R_SIZE                       equ 0004h
RPOR8_9_RPO8R_LENGTH                     equ 0004h
RPOR8_9_RPO8R_MASK                       equ 000Fh
RPOR8_9_RPO9R_POSN                       equ 0004h
RPOR8_9_RPO9R_POSITION                   equ 0004h
RPOR8_9_RPO9R_SIZE                       equ 0004h
RPOR8_9_RPO9R_LENGTH                     equ 0004h
RPOR8_9_RPO9R_MASK                       equ 00F0h
RPOR8_9_RPO8R0_POSN                      equ 0000h
RPOR8_9_RPO8R0_POSITION                  equ 0000h
RPOR8_9_RPO8R0_SIZE                      equ 0001h
RPOR8_9_RPO8R0_LENGTH                    equ 0001h
RPOR8_9_RPO8R0_MASK                      equ 0001h
RPOR8_9_RPO8R1_POSN                      equ 0001h
RPOR8_9_RPO8R1_POSITION                  equ 0001h
RPOR8_9_RPO8R1_SIZE                      equ 0001h
RPOR8_9_RPO8R1_LENGTH                    equ 0001h
RPOR8_9_RPO8R1_MASK                      equ 0002h
RPOR8_9_RPO8R2_POSN                      equ 0002h
RPOR8_9_RPO8R2_POSITION                  equ 0002h
RPOR8_9_RPO8R2_SIZE                      equ 0001h
RPOR8_9_RPO8R2_LENGTH                    equ 0001h
RPOR8_9_RPO8R2_MASK                      equ 0004h
RPOR8_9_RPO8R3_POSN                      equ 0003h
RPOR8_9_RPO8R3_POSITION                  equ 0003h
RPOR8_9_RPO8R3_SIZE                      equ 0001h
RPOR8_9_RPO8R3_LENGTH                    equ 0001h
RPOR8_9_RPO8R3_MASK                      equ 0008h
RPOR8_9_RPO9R0_POSN                      equ 0004h
RPOR8_9_RPO9R0_POSITION                  equ 0004h
RPOR8_9_RPO9R0_SIZE                      equ 0001h
RPOR8_9_RPO9R0_LENGTH                    equ 0001h
RPOR8_9_RPO9R0_MASK                      equ 0010h
RPOR8_9_RPO9R1_POSN                      equ 0005h
RPOR8_9_RPO9R1_POSITION                  equ 0005h
RPOR8_9_RPO9R1_SIZE                      equ 0001h
RPOR8_9_RPO9R1_LENGTH                    equ 0001h
RPOR8_9_RPO9R1_MASK                      equ 0020h
RPOR8_9_RPO9R2_POSN                      equ 0006h
RPOR8_9_RPO9R2_POSITION                  equ 0006h
RPOR8_9_RPO9R2_SIZE                      equ 0001h
RPOR8_9_RPO9R2_LENGTH                    equ 0001h
RPOR8_9_RPO9R2_MASK                      equ 0040h
RPOR8_9_RPO9R3_POSN                      equ 0007h
RPOR8_9_RPO9R3_POSITION                  equ 0007h
RPOR8_9_RPO9R3_SIZE                      equ 0001h
RPOR8_9_RPO9R3_LENGTH                    equ 0001h
RPOR8_9_RPO9R3_MASK                      equ 0080h

// Register: RPOR10_11
#define RPOR10_11 RPOR10_11
RPOR10_11                                equ 0E17h
// bitfield definitions
RPOR10_11_RPO10R_POSN                    equ 0000h
RPOR10_11_RPO10R_POSITION                equ 0000h
RPOR10_11_RPO10R_SIZE                    equ 0004h
RPOR10_11_RPO10R_LENGTH                  equ 0004h
RPOR10_11_RPO10R_MASK                    equ 000Fh
RPOR10_11_RPO11R_POSN                    equ 0004h
RPOR10_11_RPO11R_POSITION                equ 0004h
RPOR10_11_RPO11R_SIZE                    equ 0004h
RPOR10_11_RPO11R_LENGTH                  equ 0004h
RPOR10_11_RPO11R_MASK                    equ 00F0h
RPOR10_11_RPO10R0_POSN                   equ 0000h
RPOR10_11_RPO10R0_POSITION               equ 0000h
RPOR10_11_RPO10R0_SIZE                   equ 0001h
RPOR10_11_RPO10R0_LENGTH                 equ 0001h
RPOR10_11_RPO10R0_MASK                   equ 0001h
RPOR10_11_RPO10R1_POSN                   equ 0001h
RPOR10_11_RPO10R1_POSITION               equ 0001h
RPOR10_11_RPO10R1_SIZE                   equ 0001h
RPOR10_11_RPO10R1_LENGTH                 equ 0001h
RPOR10_11_RPO10R1_MASK                   equ 0002h
RPOR10_11_RPO10R2_POSN                   equ 0002h
RPOR10_11_RPO10R2_POSITION               equ 0002h
RPOR10_11_RPO10R2_SIZE                   equ 0001h
RPOR10_11_RPO10R2_LENGTH                 equ 0001h
RPOR10_11_RPO10R2_MASK                   equ 0004h
RPOR10_11_RPO10R3_POSN                   equ 0003h
RPOR10_11_RPO10R3_POSITION               equ 0003h
RPOR10_11_RPO10R3_SIZE                   equ 0001h
RPOR10_11_RPO10R3_LENGTH                 equ 0001h
RPOR10_11_RPO10R3_MASK                   equ 0008h
RPOR10_11_RPO11R0_POSN                   equ 0004h
RPOR10_11_RPO11R0_POSITION               equ 0004h
RPOR10_11_RPO11R0_SIZE                   equ 0001h
RPOR10_11_RPO11R0_LENGTH                 equ 0001h
RPOR10_11_RPO11R0_MASK                   equ 0010h
RPOR10_11_RPO11R1_POSN                   equ 0005h
RPOR10_11_RPO11R1_POSITION               equ 0005h
RPOR10_11_RPO11R1_SIZE                   equ 0001h
RPOR10_11_RPO11R1_LENGTH                 equ 0001h
RPOR10_11_RPO11R1_MASK                   equ 0020h
RPOR10_11_RPO11R2_POSN                   equ 0006h
RPOR10_11_RPO11R2_POSITION               equ 0006h
RPOR10_11_RPO11R2_SIZE                   equ 0001h
RPOR10_11_RPO11R2_LENGTH                 equ 0001h
RPOR10_11_RPO11R2_MASK                   equ 0040h
RPOR10_11_RPO11R3_POSN                   equ 0007h
RPOR10_11_RPO11R3_POSITION               equ 0007h
RPOR10_11_RPO11R3_SIZE                   equ 0001h
RPOR10_11_RPO11R3_LENGTH                 equ 0001h
RPOR10_11_RPO11R3_MASK                   equ 0080h

