GopalSaraf/Practicals/PSDL/include/proc/pic18f66j94.inc
// Register: RPINR52_53
#define RPINR52_53 RPINR52_53
RPINR52_53                               equ 0E44h
// bitfield definitions
RPINR52_53_PBIO6R_POSN                   equ 0000h
RPINR52_53_PBIO6R_POSITION               equ 0000h
RPINR52_53_PBIO6R_SIZE                   equ 0004h
RPINR52_53_PBIO6R_LENGTH                 equ 0004h
RPINR52_53_PBIO6R_MASK                   equ 000Fh
RPINR52_53_PBIO7R_POSN                   equ 0004h
RPINR52_53_PBIO7R_POSITION               equ 0004h
RPINR52_53_PBIO7R_SIZE                   equ 0004h
RPINR52_53_PBIO7R_LENGTH                 equ 0004h
RPINR52_53_PBIO7R_MASK                   equ 00F0h
RPINR52_53_PBIO6R0_POSN                  equ 0000h
RPINR52_53_PBIO6R0_POSITION              equ 0000h
RPINR52_53_PBIO6R0_SIZE                  equ 0001h
RPINR52_53_PBIO6R0_LENGTH                equ 0001h
RPINR52_53_PBIO6R0_MASK                  equ 0001h
RPINR52_53_PBIO6R1_POSN                  equ 0001h
RPINR52_53_PBIO6R1_POSITION              equ 0001h
RPINR52_53_PBIO6R1_SIZE                  equ 0001h
RPINR52_53_PBIO6R1_LENGTH                equ 0001h
RPINR52_53_PBIO6R1_MASK                  equ 0002h
RPINR52_53_PBIO6R2_POSN                  equ 0002h
RPINR52_53_PBIO6R2_POSITION              equ 0002h
RPINR52_53_PBIO6R2_SIZE                  equ 0001h
RPINR52_53_PBIO6R2_LENGTH                equ 0001h
RPINR52_53_PBIO6R2_MASK                  equ 0004h
RPINR52_53_PBIO6R3_POSN                  equ 0003h
RPINR52_53_PBIO6R3_POSITION              equ 0003h
RPINR52_53_PBIO6R3_SIZE                  equ 0001h
RPINR52_53_PBIO6R3_LENGTH                equ 0001h
RPINR52_53_PBIO6R3_MASK                  equ 0008h
RPINR52_53_PBIO7R0_POSN                  equ 0004h
RPINR52_53_PBIO7R0_POSITION              equ 0004h
RPINR52_53_PBIO7R0_SIZE                  equ 0001h
RPINR52_53_PBIO7R0_LENGTH                equ 0001h
RPINR52_53_PBIO7R0_MASK                  equ 0010h
RPINR52_53_PBIO7R1_POSN                  equ 0005h
RPINR52_53_PBIO7R1_POSITION              equ 0005h
RPINR52_53_PBIO7R1_SIZE                  equ 0001h
RPINR52_53_PBIO7R1_LENGTH                equ 0001h
RPINR52_53_PBIO7R1_MASK                  equ 0020h
RPINR52_53_PBIO7R2_POSN                  equ 0006h
RPINR52_53_PBIO7R2_POSITION              equ 0006h
RPINR52_53_PBIO7R2_SIZE                  equ 0001h
RPINR52_53_PBIO7R2_LENGTH                equ 0001h
RPINR52_53_PBIO7R2_MASK                  equ 0040h
RPINR52_53_PBIO7R3_POSN                  equ 0007h
RPINR52_53_PBIO7R3_POSITION              equ 0007h
RPINR52_53_PBIO7R3_SIZE                  equ 0001h
RPINR52_53_PBIO7R3_LENGTH                equ 0001h
RPINR52_53_PBIO7R3_MASK                  equ 0080h

// Register: ANCON3
#define ANCON3 ANCON3
ANCON3                                   equ 0E45h
// bitfield definitions
ANCON3_ANSEL16_POSN                      equ 0000h
ANCON3_ANSEL16_POSITION                  equ 0000h
ANCON3_ANSEL16_SIZE                      equ 0001h
ANCON3_ANSEL16_LENGTH                    equ 0001h
ANCON3_ANSEL16_MASK                      equ 0001h
ANCON3_ANSEL17_POSN                      equ 0001h
ANCON3_ANSEL17_POSITION                  equ 0001h
ANCON3_ANSEL17_SIZE                      equ 0001h
ANCON3_ANSEL17_LENGTH                    equ 0001h
ANCON3_ANSEL17_MASK                      equ 0002h
ANCON3_ANSEL18_POSN                      equ 0002h
ANCON3_ANSEL18_POSITION                  equ 0002h
ANCON3_ANSEL18_SIZE                      equ 0001h
ANCON3_ANSEL18_LENGTH                    equ 0001h
ANCON3_ANSEL18_MASK                      equ 0004h
ANCON3_ANSEL19_POSN                      equ 0003h
ANCON3_ANSEL19_POSITION                  equ 0003h
ANCON3_ANSEL19_SIZE                      equ 0001h
ANCON3_ANSEL19_LENGTH                    equ 0001h
ANCON3_ANSEL19_MASK                      equ 0008h
ANCON3_ANSEL20_POSN                      equ 0004h
ANCON3_ANSEL20_POSITION                  equ 0004h
ANCON3_ANSEL20_SIZE                      equ 0001h
ANCON3_ANSEL20_LENGTH                    equ 0001h
ANCON3_ANSEL20_MASK                      equ 0010h
ANCON3_ANSEL21_POSN                      equ 0005h
ANCON3_ANSEL21_POSITION                  equ 0005h
ANCON3_ANSEL21_SIZE                      equ 0001h
ANCON3_ANSEL21_LENGTH                    equ 0001h
ANCON3_ANSEL21_MASK                      equ 0020h
ANCON3_ANSEL22_POSN                      equ 0006h
ANCON3_ANSEL22_POSITION                  equ 0006h
ANCON3_ANSEL22_SIZE                      equ 0001h
ANCON3_ANSEL22_LENGTH                    equ 0001h
ANCON3_ANSEL22_MASK                      equ 0040h
ANCON3_ANSEL23_POSN                      equ 0007h
ANCON3_ANSEL23_POSITION                  equ 0007h
ANCON3_ANSEL23_SIZE                      equ 0001h
ANCON3_ANSEL23_LENGTH                    equ 0001h
ANCON3_ANSEL23_MASK                      equ 0080h

// Register: ANCON2
#define ANCON2 ANCON2
ANCON2                                   equ 0E46h
// bitfield definitions
ANCON2_ANSEL8_POSN                       equ 0000h
ANCON2_ANSEL8_POSITION                   equ 0000h
ANCON2_ANSEL8_SIZE                       equ 0001h
ANCON2_ANSEL8_LENGTH                     equ 0001h
ANCON2_ANSEL8_MASK                       equ 0001h
ANCON2_ANSEL9_POSN                       equ 0001h
ANCON2_ANSEL9_POSITION                   equ 0001h
ANCON2_ANSEL9_SIZE                       equ 0001h
ANCON2_ANSEL9_LENGTH                     equ 0001h
ANCON2_ANSEL9_MASK                       equ 0002h
ANCON2_ANSEL10_POSN                      equ 0002h
ANCON2_ANSEL10_POSITION                  equ 0002h
ANCON2_ANSEL10_SIZE                      equ 0001h
ANCON2_ANSEL10_LENGTH                    equ 0001h
ANCON2_ANSEL10_MASK                      equ 0004h
ANCON2_ANSEL11_POSN                      equ 0003h
ANCON2_ANSEL11_POSITION                  equ 0003h
ANCON2_ANSEL11_SIZE                      equ 0001h
ANCON2_ANSEL11_LENGTH                    equ 0001h
ANCON2_ANSEL11_MASK                      equ 0008h
ANCON2_ANSEL12_POSN                      equ 0004h
ANCON2_ANSEL12_POSITION                  equ 0004h
ANCON2_ANSEL12_SIZE                      equ 0001h
ANCON2_ANSEL12_LENGTH                    equ 0001h
ANCON2_ANSEL12_MASK                      equ 0010h
ANCON2_ANSEL13_POSN                      equ 0005h
ANCON2_ANSEL13_POSITION                  equ 0005h
ANCON2_ANSEL13_SIZE                      equ 0001h
ANCON2_ANSEL13_LENGTH                    equ 0001h
ANCON2_ANSEL13_MASK                      equ 0020h
ANCON2_ANSEL14_POSN                      equ 0006h
ANCON2_ANSEL14_POSITION                  equ 0006h
ANCON2_ANSEL14_SIZE                      equ 0001h
ANCON2_ANSEL14_LENGTH                    equ 0001h
ANCON2_ANSEL14_MASK                      equ 0040h
ANCON2_ANSEL15_POSN                      equ 0007h
ANCON2_ANSEL15_POSITION                  equ 0007h
ANCON2_ANSEL15_SIZE                      equ 0001h
ANCON2_ANSEL15_LENGTH                    equ 0001h
ANCON2_ANSEL15_MASK                      equ 0080h
ANCON2_PCFG16_POSN                       equ 0000h
ANCON2_PCFG16_POSITION                   equ 0000h
ANCON2_PCFG16_SIZE                       equ 0001h
ANCON2_PCFG16_LENGTH                     equ 0001h
ANCON2_PCFG16_MASK                       equ 0001h
ANCON2_PCFG17_POSN                       equ 0001h
ANCON2_PCFG17_POSITION                   equ 0001h
ANCON2_PCFG17_SIZE                       equ 0001h
ANCON2_PCFG17_LENGTH                     equ 0001h
ANCON2_PCFG17_MASK                       equ 0002h
ANCON2_PCFG18_POSN                       equ 0002h
ANCON2_PCFG18_POSITION                   equ 0002h
ANCON2_PCFG18_SIZE                       equ 0001h
ANCON2_PCFG18_LENGTH                     equ 0001h
ANCON2_PCFG18_MASK                       equ 0004h
ANCON2_PCFG19_POSN                       equ 0003h
ANCON2_PCFG19_POSITION                   equ 0003h
ANCON2_PCFG19_SIZE                       equ 0001h
ANCON2_PCFG19_LENGTH                     equ 0001h
ANCON2_PCFG19_MASK                       equ 0008h
ANCON2_PCFG20_POSN                       equ 0004h
ANCON2_PCFG20_POSITION                   equ 0004h
ANCON2_PCFG20_SIZE                       equ 0001h
ANCON2_PCFG20_LENGTH                     equ 0001h
ANCON2_PCFG20_MASK                       equ 0010h
ANCON2_PCFG21_POSN                       equ 0005h
ANCON2_PCFG21_POSITION                   equ 0005h
ANCON2_PCFG21_SIZE                       equ 0001h
ANCON2_PCFG21_LENGTH                     equ 0001h
ANCON2_PCFG21_MASK                       equ 0020h
ANCON2_PCFG22_POSN                       equ 0006h
ANCON2_PCFG22_POSITION                   equ 0006h
ANCON2_PCFG22_SIZE                       equ 0001h
ANCON2_PCFG22_LENGTH                     equ 0001h
ANCON2_PCFG22_MASK                       equ 0040h
ANCON2_PCFG23_POSN                       equ 0007h
ANCON2_PCFG23_POSITION                   equ 0007h
ANCON2_PCFG23_SIZE                       equ 0001h
ANCON2_PCFG23_LENGTH                     equ 0001h
ANCON2_PCFG23_MASK                       equ 0080h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0E47h
// bitfield definitions
ANCON1_ANSEL0_POSN                       equ 0000h
ANCON1_ANSEL0_POSITION                   equ 0000h
ANCON1_ANSEL0_SIZE                       equ 0001h
ANCON1_ANSEL0_LENGTH                     equ 0001h
ANCON1_ANSEL0_MASK                       equ 0001h
ANCON1_ANSEL1_POSN                       equ 0001h
ANCON1_ANSEL1_POSITION                   equ 0001h
ANCON1_ANSEL1_SIZE                       equ 0001h
ANCON1_ANSEL1_LENGTH                     equ 0001h
ANCON1_ANSEL1_MASK                       equ 0002h
ANCON1_ANSEL2_POSN                       equ 0002h
ANCON1_ANSEL2_POSITION                   equ 0002h
ANCON1_ANSEL2_SIZE                       equ 0001h
ANCON1_ANSEL2_LENGTH                     equ 0001h
ANCON1_ANSEL2_MASK                       equ 0004h
ANCON1_ANSEL3_POSN                       equ 0003h
ANCON1_ANSEL3_POSITION                   equ 0003h
ANCON1_ANSEL3_SIZE                       equ 0001h
ANCON1_ANSEL3_LENGTH                     equ 0001h
ANCON1_ANSEL3_MASK                       equ 0008h
ANCON1_ANSEL4_POSN                       equ 0004h
ANCON1_ANSEL4_POSITION                   equ 0004h
ANCON1_ANSEL4_SIZE                       equ 0001h
ANCON1_ANSEL4_LENGTH                     equ 0001h
ANCON1_ANSEL4_MASK                       equ 0010h
ANCON1_ANSEL5_POSN                       equ 0005h
ANCON1_ANSEL5_POSITION                   equ 0005h
ANCON1_ANSEL5_SIZE                       equ 0001h
ANCON1_ANSEL5_LENGTH                     equ 0001h
ANCON1_ANSEL5_MASK                       equ 0020h
ANCON1_ANSEL6_POSN                       equ 0006h
ANCON1_ANSEL6_POSITION                   equ 0006h
ANCON1_ANSEL6_SIZE                       equ 0001h
ANCON1_ANSEL6_LENGTH                     equ 0001h
ANCON1_ANSEL6_MASK                       equ 0040h
ANCON1_ANSEL7_POSN                       equ 0007h
ANCON1_ANSEL7_POSITION                   equ 0007h
ANCON1_ANSEL7_SIZE                       equ 0001h
ANCON1_ANSEL7_LENGTH                     equ 0001h
ANCON1_ANSEL7_MASK                       equ 0080h
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h
ANCON1_PCFG12_POSN                       equ 0004h
ANCON1_PCFG12_POSITION                   equ 0004h
ANCON1_PCFG12_SIZE                       equ 0001h
ANCON1_PCFG12_LENGTH                     equ 0001h
ANCON1_PCFG12_MASK                       equ 0010h
ANCON1_PCFG13_POSN                       equ 0005h
ANCON1_PCFG13_POSITION                   equ 0005h
ANCON1_PCFG13_SIZE                       equ 0001h
ANCON1_PCFG13_LENGTH                     equ 0001h
ANCON1_PCFG13_MASK                       equ 0020h
ANCON1_PCFG14_POSN                       equ 0006h
ANCON1_PCFG14_POSITION                   equ 0006h
ANCON1_PCFG14_SIZE                       equ 0001h
ANCON1_PCFG14_LENGTH                     equ 0001h
ANCON1_PCFG14_MASK                       equ 0040h
ANCON1_PCFG15_POSN                       equ 0007h
ANCON1_PCFG15_POSITION                   equ 0007h
ANCON1_PCFG15_SIZE                       equ 0001h
ANCON1_PCFG15_LENGTH                     equ 0001h
ANCON1_PCFG15_MASK                       equ 0080h

