GopalSaraf/Practicals/PSDL/include/proc/pic18f66j94.inc
// Register: ADCHIT1H
#define ADCHIT1H ADCHIT1H
ADCHIT1H                                 equ 0E81h
// bitfield definitions
ADCHIT1H_CHH_POSN                        equ 0000h
ADCHIT1H_CHH_POSITION                    equ 0000h
ADCHIT1H_CHH_SIZE                        equ 0008h
ADCHIT1H_CHH_LENGTH                      equ 0008h
ADCHIT1H_CHH_MASK                        equ 00FFh
ADCHIT1H_CHH24_POSN                      equ 0000h
ADCHIT1H_CHH24_POSITION                  equ 0000h
ADCHIT1H_CHH24_SIZE                      equ 0001h
ADCHIT1H_CHH24_LENGTH                    equ 0001h
ADCHIT1H_CHH24_MASK                      equ 0001h
ADCHIT1H_CHH25_POSN                      equ 0001h
ADCHIT1H_CHH25_POSITION                  equ 0001h
ADCHIT1H_CHH25_SIZE                      equ 0001h
ADCHIT1H_CHH25_LENGTH                    equ 0001h
ADCHIT1H_CHH25_MASK                      equ 0002h
ADCHIT1H_CHH26_POSN                      equ 0002h
ADCHIT1H_CHH26_POSITION                  equ 0002h
ADCHIT1H_CHH26_SIZE                      equ 0001h
ADCHIT1H_CHH26_LENGTH                    equ 0001h
ADCHIT1H_CHH26_MASK                      equ 0004h
ADCHIT1H_CHH27_POSN                      equ 0003h
ADCHIT1H_CHH27_POSITION                  equ 0003h
ADCHIT1H_CHH27_SIZE                      equ 0001h
ADCHIT1H_CHH27_LENGTH                    equ 0001h
ADCHIT1H_CHH27_MASK                      equ 0008h
ADCHIT1H_CHH28_POSN                      equ 0004h
ADCHIT1H_CHH28_POSITION                  equ 0004h
ADCHIT1H_CHH28_SIZE                      equ 0001h
ADCHIT1H_CHH28_LENGTH                    equ 0001h
ADCHIT1H_CHH28_MASK                      equ 0010h
ADCHIT1H_CHH29_POSN                      equ 0005h
ADCHIT1H_CHH29_POSITION                  equ 0005h
ADCHIT1H_CHH29_SIZE                      equ 0001h
ADCHIT1H_CHH29_LENGTH                    equ 0001h
ADCHIT1H_CHH29_MASK                      equ 0020h
ADCHIT1H_CHH30_POSN                      equ 0006h
ADCHIT1H_CHH30_POSITION                  equ 0006h
ADCHIT1H_CHH30_SIZE                      equ 0001h
ADCHIT1H_CHH30_LENGTH                    equ 0001h
ADCHIT1H_CHH30_MASK                      equ 0040h

// Register: ADCSS0L
#define ADCSS0L ADCSS0L
ADCSS0L                                  equ 0E82h
// bitfield definitions
ADCSS0L_CSS_POSN                         equ 0000h
ADCSS0L_CSS_POSITION                     equ 0000h
ADCSS0L_CSS_SIZE                         equ 0008h
ADCSS0L_CSS_LENGTH                       equ 0008h
ADCSS0L_CSS_MASK                         equ 00FFh
ADCSS0L_CSS0_POSN                        equ 0000h
ADCSS0L_CSS0_POSITION                    equ 0000h
ADCSS0L_CSS0_SIZE                        equ 0001h
ADCSS0L_CSS0_LENGTH                      equ 0001h
ADCSS0L_CSS0_MASK                        equ 0001h
ADCSS0L_CSS1_POSN                        equ 0001h
ADCSS0L_CSS1_POSITION                    equ 0001h
ADCSS0L_CSS1_SIZE                        equ 0001h
ADCSS0L_CSS1_LENGTH                      equ 0001h
ADCSS0L_CSS1_MASK                        equ 0002h
ADCSS0L_CSS2_POSN                        equ 0002h
ADCSS0L_CSS2_POSITION                    equ 0002h
ADCSS0L_CSS2_SIZE                        equ 0001h
ADCSS0L_CSS2_LENGTH                      equ 0001h
ADCSS0L_CSS2_MASK                        equ 0004h
ADCSS0L_CSS3_POSN                        equ 0003h
ADCSS0L_CSS3_POSITION                    equ 0003h
ADCSS0L_CSS3_SIZE                        equ 0001h
ADCSS0L_CSS3_LENGTH                      equ 0001h
ADCSS0L_CSS3_MASK                        equ 0008h
ADCSS0L_CSS4_POSN                        equ 0004h
ADCSS0L_CSS4_POSITION                    equ 0004h
ADCSS0L_CSS4_SIZE                        equ 0001h
ADCSS0L_CSS4_LENGTH                      equ 0001h
ADCSS0L_CSS4_MASK                        equ 0010h
ADCSS0L_CSS5_POSN                        equ 0005h
ADCSS0L_CSS5_POSITION                    equ 0005h
ADCSS0L_CSS5_SIZE                        equ 0001h
ADCSS0L_CSS5_LENGTH                      equ 0001h
ADCSS0L_CSS5_MASK                        equ 0020h
ADCSS0L_CSS6_POSN                        equ 0006h
ADCSS0L_CSS6_POSITION                    equ 0006h
ADCSS0L_CSS6_SIZE                        equ 0001h
ADCSS0L_CSS6_LENGTH                      equ 0001h
ADCSS0L_CSS6_MASK                        equ 0040h
ADCSS0L_CSS7_POSN                        equ 0007h
ADCSS0L_CSS7_POSITION                    equ 0007h
ADCSS0L_CSS7_SIZE                        equ 0001h
ADCSS0L_CSS7_LENGTH                      equ 0001h
ADCSS0L_CSS7_MASK                        equ 0080h

// Register: ADCSS0H
#define ADCSS0H ADCSS0H
ADCSS0H                                  equ 0E83h
// bitfield definitions
ADCSS0H_CSS_POSN                         equ 0000h
ADCSS0H_CSS_POSITION                     equ 0000h
ADCSS0H_CSS_SIZE                         equ 0008h
ADCSS0H_CSS_LENGTH                       equ 0008h
ADCSS0H_CSS_MASK                         equ 00FFh
ADCSS0H_CSS8_POSN                        equ 0000h
ADCSS0H_CSS8_POSITION                    equ 0000h
ADCSS0H_CSS8_SIZE                        equ 0001h
ADCSS0H_CSS8_LENGTH                      equ 0001h
ADCSS0H_CSS8_MASK                        equ 0001h
ADCSS0H_CSS9_POSN                        equ 0001h
ADCSS0H_CSS9_POSITION                    equ 0001h
ADCSS0H_CSS9_SIZE                        equ 0001h
ADCSS0H_CSS9_LENGTH                      equ 0001h
ADCSS0H_CSS9_MASK                        equ 0002h
ADCSS0H_CSS10_POSN                       equ 0002h
ADCSS0H_CSS10_POSITION                   equ 0002h
ADCSS0H_CSS10_SIZE                       equ 0001h
ADCSS0H_CSS10_LENGTH                     equ 0001h
ADCSS0H_CSS10_MASK                       equ 0004h
ADCSS0H_CSS11_POSN                       equ 0003h
ADCSS0H_CSS11_POSITION                   equ 0003h
ADCSS0H_CSS11_SIZE                       equ 0001h
ADCSS0H_CSS11_LENGTH                     equ 0001h
ADCSS0H_CSS11_MASK                       equ 0008h
ADCSS0H_CSS12_POSN                       equ 0004h
ADCSS0H_CSS12_POSITION                   equ 0004h
ADCSS0H_CSS12_SIZE                       equ 0001h
ADCSS0H_CSS12_LENGTH                     equ 0001h
ADCSS0H_CSS12_MASK                       equ 0010h
ADCSS0H_CSS13_POSN                       equ 0005h
ADCSS0H_CSS13_POSITION                   equ 0005h
ADCSS0H_CSS13_SIZE                       equ 0001h
ADCSS0H_CSS13_LENGTH                     equ 0001h
ADCSS0H_CSS13_MASK                       equ 0020h
ADCSS0H_CSS14_POSN                       equ 0006h
ADCSS0H_CSS14_POSITION                   equ 0006h
ADCSS0H_CSS14_SIZE                       equ 0001h
ADCSS0H_CSS14_LENGTH                     equ 0001h
ADCSS0H_CSS14_MASK                       equ 0040h
ADCSS0H_CSS15_POSN                       equ 0007h
ADCSS0H_CSS15_POSITION                   equ 0007h
ADCSS0H_CSS15_SIZE                       equ 0001h
ADCSS0H_CSS15_LENGTH                     equ 0001h
ADCSS0H_CSS15_MASK                       equ 0080h

