GopalSaraf/Practicals/PSDL/include/proc/pic18f66j94.inc
// Register: LCDDATA60
#define LCDDATA60 LCDDATA60
LCDDATA60                                equ 0ECAh
// bitfield definitions
LCDDATA60_S32C7_POSN                     equ 0000h
LCDDATA60_S32C7_POSITION                 equ 0000h
LCDDATA60_S32C7_SIZE                     equ 0001h
LCDDATA60_S32C7_LENGTH                   equ 0001h
LCDDATA60_S32C7_MASK                     equ 0001h
LCDDATA60_S33C7_POSN                     equ 0001h
LCDDATA60_S33C7_POSITION                 equ 0001h
LCDDATA60_S33C7_SIZE                     equ 0001h
LCDDATA60_S33C7_LENGTH                   equ 0001h
LCDDATA60_S33C7_MASK                     equ 0002h
LCDDATA60_S34C7_POSN                     equ 0002h
LCDDATA60_S34C7_POSITION                 equ 0002h
LCDDATA60_S34C7_SIZE                     equ 0001h
LCDDATA60_S34C7_LENGTH                   equ 0001h
LCDDATA60_S34C7_MASK                     equ 0004h
LCDDATA60_S35C7_POSN                     equ 0003h
LCDDATA60_S35C7_POSITION                 equ 0003h
LCDDATA60_S35C7_SIZE                     equ 0001h
LCDDATA60_S35C7_LENGTH                   equ 0001h
LCDDATA60_S35C7_MASK                     equ 0008h
LCDDATA60_S36C7_POSN                     equ 0004h
LCDDATA60_S36C7_POSITION                 equ 0004h
LCDDATA60_S36C7_SIZE                     equ 0001h
LCDDATA60_S36C7_LENGTH                   equ 0001h
LCDDATA60_S36C7_MASK                     equ 0010h
LCDDATA60_S37C7_POSN                     equ 0005h
LCDDATA60_S37C7_POSITION                 equ 0005h
LCDDATA60_S37C7_SIZE                     equ 0001h
LCDDATA60_S37C7_LENGTH                   equ 0001h
LCDDATA60_S37C7_MASK                     equ 0020h
LCDDATA60_S38C7_POSN                     equ 0006h
LCDDATA60_S38C7_POSITION                 equ 0006h
LCDDATA60_S38C7_SIZE                     equ 0001h
LCDDATA60_S38C7_LENGTH                   equ 0001h
LCDDATA60_S38C7_MASK                     equ 0040h
LCDDATA60_S39C7_POSN                     equ 0007h
LCDDATA60_S39C7_POSITION                 equ 0007h
LCDDATA60_S39C7_SIZE                     equ 0001h
LCDDATA60_S39C7_LENGTH                   equ 0001h
LCDDATA60_S39C7_MASK                     equ 0080h

// Register: LCDDATA61
#define LCDDATA61 LCDDATA61
LCDDATA61                                equ 0ECBh
// bitfield definitions
LCDDATA61_S40C7_POSN                     equ 0000h
LCDDATA61_S40C7_POSITION                 equ 0000h
LCDDATA61_S40C7_SIZE                     equ 0001h
LCDDATA61_S40C7_LENGTH                   equ 0001h
LCDDATA61_S40C7_MASK                     equ 0001h
LCDDATA61_S41C7_POSN                     equ 0001h
LCDDATA61_S41C7_POSITION                 equ 0001h
LCDDATA61_S41C7_SIZE                     equ 0001h
LCDDATA61_S41C7_LENGTH                   equ 0001h
LCDDATA61_S41C7_MASK                     equ 0002h
LCDDATA61_S42C7_POSN                     equ 0002h
LCDDATA61_S42C7_POSITION                 equ 0002h
LCDDATA61_S42C7_SIZE                     equ 0001h
LCDDATA61_S42C7_LENGTH                   equ 0001h
LCDDATA61_S42C7_MASK                     equ 0004h
LCDDATA61_S43C7_POSN                     equ 0003h
LCDDATA61_S43C7_POSITION                 equ 0003h
LCDDATA61_S43C7_SIZE                     equ 0001h
LCDDATA61_S43C7_LENGTH                   equ 0001h
LCDDATA61_S43C7_MASK                     equ 0008h
LCDDATA61_S44C7_POSN                     equ 0004h
LCDDATA61_S44C7_POSITION                 equ 0004h
LCDDATA61_S44C7_SIZE                     equ 0001h
LCDDATA61_S44C7_LENGTH                   equ 0001h
LCDDATA61_S44C7_MASK                     equ 0010h
LCDDATA61_S45C7_POSN                     equ 0005h
LCDDATA61_S45C7_POSITION                 equ 0005h
LCDDATA61_S45C7_SIZE                     equ 0001h
LCDDATA61_S45C7_LENGTH                   equ 0001h
LCDDATA61_S45C7_MASK                     equ 0020h
LCDDATA61_S46C7_POSN                     equ 0006h
LCDDATA61_S46C7_POSITION                 equ 0006h
LCDDATA61_S46C7_SIZE                     equ 0001h
LCDDATA61_S46C7_LENGTH                   equ 0001h
LCDDATA61_S46C7_MASK                     equ 0040h
LCDDATA61_S47C7_POSN                     equ 0007h
LCDDATA61_S47C7_POSITION                 equ 0007h
LCDDATA61_S47C7_SIZE                     equ 0001h
LCDDATA61_S47C7_LENGTH                   equ 0001h
LCDDATA61_S47C7_MASK                     equ 0080h

// Register: LCDDATA62
#define LCDDATA62 LCDDATA62
LCDDATA62                                equ 0ECCh
// bitfield definitions
LCDDATA62_S48C7_POSN                     equ 0000h
LCDDATA62_S48C7_POSITION                 equ 0000h
LCDDATA62_S48C7_SIZE                     equ 0001h
LCDDATA62_S48C7_LENGTH                   equ 0001h
LCDDATA62_S48C7_MASK                     equ 0001h
LCDDATA62_S49C7_POSN                     equ 0001h
LCDDATA62_S49C7_POSITION                 equ 0001h
LCDDATA62_S49C7_SIZE                     equ 0001h
LCDDATA62_S49C7_LENGTH                   equ 0001h
LCDDATA62_S49C7_MASK                     equ 0002h
LCDDATA62_S50C7_POSN                     equ 0002h
LCDDATA62_S50C7_POSITION                 equ 0002h
LCDDATA62_S50C7_SIZE                     equ 0001h
LCDDATA62_S50C7_LENGTH                   equ 0001h
LCDDATA62_S50C7_MASK                     equ 0004h
LCDDATA62_S51C7_POSN                     equ 0003h
LCDDATA62_S51C7_POSITION                 equ 0003h
LCDDATA62_S51C7_SIZE                     equ 0001h
LCDDATA62_S51C7_LENGTH                   equ 0001h
LCDDATA62_S51C7_MASK                     equ 0008h
LCDDATA62_S52C7_POSN                     equ 0004h
LCDDATA62_S52C7_POSITION                 equ 0004h
LCDDATA62_S52C7_SIZE                     equ 0001h
LCDDATA62_S52C7_LENGTH                   equ 0001h
LCDDATA62_S52C7_MASK                     equ 0010h
LCDDATA62_S53C7_POSN                     equ 0005h
LCDDATA62_S53C7_POSITION                 equ 0005h
LCDDATA62_S53C7_SIZE                     equ 0001h
LCDDATA62_S53C7_LENGTH                   equ 0001h
LCDDATA62_S53C7_MASK                     equ 0020h
LCDDATA62_S54C7_POSN                     equ 0006h
LCDDATA62_S54C7_POSITION                 equ 0006h
LCDDATA62_S54C7_SIZE                     equ 0001h
LCDDATA62_S54C7_LENGTH                   equ 0001h
LCDDATA62_S54C7_MASK                     equ 0040h
LCDDATA62_S55C7_POSN                     equ 0007h
LCDDATA62_S55C7_POSITION                 equ 0007h
LCDDATA62_S55C7_SIZE                     equ 0001h
LCDDATA62_S55C7_LENGTH                   equ 0001h
LCDDATA62_S55C7_MASK                     equ 0080h

// Register: LCDDATA63
#define LCDDATA63 LCDDATA63
LCDDATA63                                equ 0ECDh
// bitfield definitions
LCDDATA63_S56C7_POSN                     equ 0000h
LCDDATA63_S56C7_POSITION                 equ 0000h
LCDDATA63_S56C7_SIZE                     equ 0001h
LCDDATA63_S56C7_LENGTH                   equ 0001h
LCDDATA63_S56C7_MASK                     equ 0001h
LCDDATA63_S57C7_POSN                     equ 0001h
LCDDATA63_S57C7_POSITION                 equ 0001h
LCDDATA63_S57C7_SIZE                     equ 0001h
LCDDATA63_S57C7_LENGTH                   equ 0001h
LCDDATA63_S57C7_MASK                     equ 0002h
LCDDATA63_S58C7_POSN                     equ 0002h
LCDDATA63_S58C7_POSITION                 equ 0002h
LCDDATA63_S58C7_SIZE                     equ 0001h
LCDDATA63_S58C7_LENGTH                   equ 0001h
LCDDATA63_S58C7_MASK                     equ 0004h
LCDDATA63_S59C7_POSN                     equ 0003h
LCDDATA63_S59C7_POSITION                 equ 0003h
LCDDATA63_S59C7_SIZE                     equ 0001h
LCDDATA63_S59C7_LENGTH                   equ 0001h
LCDDATA63_S59C7_MASK                     equ 0008h
LCDDATA63_S60C7_POSN                     equ 0004h
LCDDATA63_S60C7_POSITION                 equ 0004h
LCDDATA63_S60C7_SIZE                     equ 0001h
LCDDATA63_S60C7_LENGTH                   equ 0001h
LCDDATA63_S60C7_MASK                     equ 0010h
LCDDATA63_S61C7_POSN                     equ 0005h
LCDDATA63_S61C7_POSITION                 equ 0005h
LCDDATA63_S61C7_SIZE                     equ 0001h
LCDDATA63_S61C7_LENGTH                   equ 0001h
LCDDATA63_S61C7_MASK                     equ 0020h
LCDDATA63_S62C7_POSN                     equ 0006h
LCDDATA63_S62C7_POSITION                 equ 0006h
LCDDATA63_S62C7_SIZE                     equ 0001h
LCDDATA63_S62C7_LENGTH                   equ 0001h
LCDDATA63_S62C7_MASK                     equ 0040h
LCDDATA63_S63C7_POSN                     equ 0007h
LCDDATA63_S63C7_POSITION                 equ 0007h
LCDDATA63_S63C7_SIZE                     equ 0001h
LCDDATA63_S63C7_LENGTH                   equ 0001h
LCDDATA63_S63C7_MASK                     equ 0080h

// Register: LCDSE0
#define LCDSE0 LCDSE0
LCDSE0                                   equ 0ECEh
// bitfield definitions
LCDSE0_SE00_POSN                         equ 0000h
LCDSE0_SE00_POSITION                     equ 0000h
LCDSE0_SE00_SIZE                         equ 0001h
LCDSE0_SE00_LENGTH                       equ 0001h
LCDSE0_SE00_MASK                         equ 0001h
LCDSE0_SE01_POSN                         equ 0001h
LCDSE0_SE01_POSITION                     equ 0001h
LCDSE0_SE01_SIZE                         equ 0001h
LCDSE0_SE01_LENGTH                       equ 0001h
LCDSE0_SE01_MASK                         equ 0002h
LCDSE0_SE02_POSN                         equ 0002h
LCDSE0_SE02_POSITION                     equ 0002h
LCDSE0_SE02_SIZE                         equ 0001h
LCDSE0_SE02_LENGTH                       equ 0001h
LCDSE0_SE02_MASK                         equ 0004h
LCDSE0_SE03_POSN                         equ 0003h
LCDSE0_SE03_POSITION                     equ 0003h
LCDSE0_SE03_SIZE                         equ 0001h
LCDSE0_SE03_LENGTH                       equ 0001h
LCDSE0_SE03_MASK                         equ 0008h
LCDSE0_SE04_POSN                         equ 0004h
LCDSE0_SE04_POSITION                     equ 0004h
LCDSE0_SE04_SIZE                         equ 0001h
LCDSE0_SE04_LENGTH                       equ 0001h
LCDSE0_SE04_MASK                         equ 0010h
LCDSE0_SE05_POSN                         equ 0005h
LCDSE0_SE05_POSITION                     equ 0005h
LCDSE0_SE05_SIZE                         equ 0001h
LCDSE0_SE05_LENGTH                       equ 0001h
LCDSE0_SE05_MASK                         equ 0020h
LCDSE0_SE06_POSN                         equ 0006h
LCDSE0_SE06_POSITION                     equ 0006h
LCDSE0_SE06_SIZE                         equ 0001h
LCDSE0_SE06_LENGTH                       equ 0001h
LCDSE0_SE06_MASK                         equ 0040h
LCDSE0_SE07_POSN                         equ 0007h
LCDSE0_SE07_POSITION                     equ 0007h
LCDSE0_SE07_SIZE                         equ 0001h
LCDSE0_SE07_LENGTH                       equ 0001h
LCDSE0_SE07_MASK                         equ 0080h

// Register: LCDSE1
#define LCDSE1 LCDSE1
LCDSE1                                   equ 0ECFh
// bitfield definitions
LCDSE1_SE08_POSN                         equ 0000h
LCDSE1_SE08_POSITION                     equ 0000h
LCDSE1_SE08_SIZE                         equ 0001h
LCDSE1_SE08_LENGTH                       equ 0001h
LCDSE1_SE08_MASK                         equ 0001h
LCDSE1_SE09_POSN                         equ 0001h
LCDSE1_SE09_POSITION                     equ 0001h
LCDSE1_SE09_SIZE                         equ 0001h
LCDSE1_SE09_LENGTH                       equ 0001h
LCDSE1_SE09_MASK                         equ 0002h
LCDSE1_SE10_POSN                         equ 0002h
LCDSE1_SE10_POSITION                     equ 0002h
LCDSE1_SE10_SIZE                         equ 0001h
LCDSE1_SE10_LENGTH                       equ 0001h
LCDSE1_SE10_MASK                         equ 0004h
LCDSE1_SE11_POSN                         equ 0003h
LCDSE1_SE11_POSITION                     equ 0003h
LCDSE1_SE11_SIZE                         equ 0001h
LCDSE1_SE11_LENGTH                       equ 0001h
LCDSE1_SE11_MASK                         equ 0008h
LCDSE1_SE12_POSN                         equ 0004h
LCDSE1_SE12_POSITION                     equ 0004h
LCDSE1_SE12_SIZE                         equ 0001h
LCDSE1_SE12_LENGTH                       equ 0001h
LCDSE1_SE12_MASK                         equ 0010h
LCDSE1_SE13_POSN                         equ 0005h
LCDSE1_SE13_POSITION                     equ 0005h
LCDSE1_SE13_SIZE                         equ 0001h
LCDSE1_SE13_LENGTH                       equ 0001h
LCDSE1_SE13_MASK                         equ 0020h
LCDSE1_SE14_POSN                         equ 0006h
LCDSE1_SE14_POSITION                     equ 0006h
LCDSE1_SE14_SIZE                         equ 0001h
LCDSE1_SE14_LENGTH                       equ 0001h
LCDSE1_SE14_MASK                         equ 0040h
LCDSE1_SE15_POSN                         equ 0007h
LCDSE1_SE15_POSITION                     equ 0007h
LCDSE1_SE15_SIZE                         equ 0001h
LCDSE1_SE15_LENGTH                       equ 0001h
LCDSE1_SE15_MASK                         equ 0080h

// Register: LCDSE2
#define LCDSE2 LCDSE2
LCDSE2                                   equ 0ED0h
// bitfield definitions
LCDSE2_SE16_POSN                         equ 0000h
LCDSE2_SE16_POSITION                     equ 0000h
LCDSE2_SE16_SIZE                         equ 0001h
LCDSE2_SE16_LENGTH                       equ 0001h
LCDSE2_SE16_MASK                         equ 0001h
LCDSE2_SE17_POSN                         equ 0001h
LCDSE2_SE17_POSITION                     equ 0001h
LCDSE2_SE17_SIZE                         equ 0001h
LCDSE2_SE17_LENGTH                       equ 0001h
LCDSE2_SE17_MASK                         equ 0002h
LCDSE2_SE18_POSN                         equ 0002h
LCDSE2_SE18_POSITION                     equ 0002h
LCDSE2_SE18_SIZE                         equ 0001h
LCDSE2_SE18_LENGTH                       equ 0001h
LCDSE2_SE18_MASK                         equ 0004h
LCDSE2_SE19_POSN                         equ 0003h
LCDSE2_SE19_POSITION                     equ 0003h
LCDSE2_SE19_SIZE                         equ 0001h
LCDSE2_SE19_LENGTH                       equ 0001h
LCDSE2_SE19_MASK                         equ 0008h
LCDSE2_SE20_POSN                         equ 0004h
LCDSE2_SE20_POSITION                     equ 0004h
LCDSE2_SE20_SIZE                         equ 0001h
LCDSE2_SE20_LENGTH                       equ 0001h
LCDSE2_SE20_MASK                         equ 0010h
LCDSE2_SE21_POSN                         equ 0005h
LCDSE2_SE21_POSITION                     equ 0005h
LCDSE2_SE21_SIZE                         equ 0001h
LCDSE2_SE21_LENGTH                       equ 0001h
LCDSE2_SE21_MASK                         equ 0020h
LCDSE2_SE22_POSN                         equ 0006h
LCDSE2_SE22_POSITION                     equ 0006h
LCDSE2_SE22_SIZE                         equ 0001h
LCDSE2_SE22_LENGTH                       equ 0001h
LCDSE2_SE22_MASK                         equ 0040h
LCDSE2_SE23_POSN                         equ 0007h
LCDSE2_SE23_POSITION                     equ 0007h
LCDSE2_SE23_SIZE                         equ 0001h
LCDSE2_SE23_LENGTH                       equ 0001h
LCDSE2_SE23_MASK                         equ 0080h

// Register: LCDSE3
#define LCDSE3 LCDSE3
LCDSE3                                   equ 0ED1h
// bitfield definitions
LCDSE3_SE24_POSN                         equ 0000h
LCDSE3_SE24_POSITION                     equ 0000h
LCDSE3_SE24_SIZE                         equ 0001h
LCDSE3_SE24_LENGTH                       equ 0001h
LCDSE3_SE24_MASK                         equ 0001h
LCDSE3_SE25_POSN                         equ 0001h
LCDSE3_SE25_POSITION                     equ 0001h
LCDSE3_SE25_SIZE                         equ 0001h
LCDSE3_SE25_LENGTH                       equ 0001h
LCDSE3_SE25_MASK                         equ 0002h
LCDSE3_SE26_POSN                         equ 0002h
LCDSE3_SE26_POSITION                     equ 0002h
LCDSE3_SE26_SIZE                         equ 0001h
LCDSE3_SE26_LENGTH                       equ 0001h
LCDSE3_SE26_MASK                         equ 0004h
LCDSE3_SE27_POSN                         equ 0003h
LCDSE3_SE27_POSITION                     equ 0003h
LCDSE3_SE27_SIZE                         equ 0001h
LCDSE3_SE27_LENGTH                       equ 0001h
LCDSE3_SE27_MASK                         equ 0008h
LCDSE3_SE28_POSN                         equ 0004h
LCDSE3_SE28_POSITION                     equ 0004h
LCDSE3_SE28_SIZE                         equ 0001h
LCDSE3_SE28_LENGTH                       equ 0001h
LCDSE3_SE28_MASK                         equ 0010h
LCDSE3_SE29_POSN                         equ 0005h
LCDSE3_SE29_POSITION                     equ 0005h
LCDSE3_SE29_SIZE                         equ 0001h
LCDSE3_SE29_LENGTH                       equ 0001h
LCDSE3_SE29_MASK                         equ 0020h
LCDSE3_SE30_POSN                         equ 0006h
LCDSE3_SE30_POSITION                     equ 0006h
LCDSE3_SE30_SIZE                         equ 0001h
LCDSE3_SE30_LENGTH                       equ 0001h
LCDSE3_SE30_MASK                         equ 0040h
LCDSE3_SE31_POSN                         equ 0007h
LCDSE3_SE31_POSITION                     equ 0007h
LCDSE3_SE31_SIZE                         equ 0001h
LCDSE3_SE31_LENGTH                       equ 0001h
LCDSE3_SE31_MASK                         equ 0080h

