GopalSaraf/Practicals/PSDL/include/proc/pic18f66j94.inc
#define S16C3                            BANKMASK(LCDDATA26), 0, b
#define S16C4                            BANKMASK(LCDDATA34), 0, b
#define S16C5                            BANKMASK(LCDDATA42), 0, b
#define S16C6                            BANKMASK(LCDDATA50), 0, b
#define S16C7                            BANKMASK(LCDDATA58), 0, b
#define S17C0                            BANKMASK(LCDDATA2), 1, b
#define S17C1                            BANKMASK(LCDDATA10), 1, b
#define S17C2                            BANKMASK(LCDDATA18), 1, b
#define S17C3                            BANKMASK(LCDDATA26), 1, b
#define S17C4                            BANKMASK(LCDDATA34), 1, b
#define S17C5                            BANKMASK(LCDDATA42), 1, b
#define S17C6                            BANKMASK(LCDDATA50), 1, b
#define S17C7                            BANKMASK(LCDDATA58), 1, b
#define S18C0                            BANKMASK(LCDDATA2), 2, b
#define S18C1                            BANKMASK(LCDDATA10), 2, b
#define S18C2                            BANKMASK(LCDDATA18), 2, b
#define S18C3                            BANKMASK(LCDDATA26), 2, b
#define S18C4                            BANKMASK(LCDDATA34), 2, b
#define S18C5                            BANKMASK(LCDDATA42), 2, b
#define S18C6                            BANKMASK(LCDDATA50), 2, b
#define S18C7                            BANKMASK(LCDDATA58), 2, b
#define S19C0                            BANKMASK(LCDDATA2), 3, b
#define S19C1                            BANKMASK(LCDDATA10), 3, b
#define S19C2                            BANKMASK(LCDDATA18), 3, b
#define S19C3                            BANKMASK(LCDDATA26), 3, b
#define S19C4                            BANKMASK(LCDDATA34), 3, b
#define S19C5                            BANKMASK(LCDDATA42), 3, b
#define S19C6                            BANKMASK(LCDDATA50), 3, b
#define S19C7                            BANKMASK(LCDDATA58), 3, b
#define S20C0                            BANKMASK(LCDDATA2), 4, b
#define S20C1                            BANKMASK(LCDDATA10), 4, b
#define S20C2                            BANKMASK(LCDDATA18), 4, b
#define S20C3                            BANKMASK(LCDDATA26), 4, b
#define S20C4                            BANKMASK(LCDDATA34), 4, b
#define S20C5                            BANKMASK(LCDDATA42), 4, b
#define S20C6                            BANKMASK(LCDDATA50), 4, b
#define S20C7                            BANKMASK(LCDDATA58), 4, b
#define S21C0                            BANKMASK(LCDDATA2), 5, b
#define S21C1                            BANKMASK(LCDDATA10), 5, b
#define S21C2                            BANKMASK(LCDDATA18), 5, b
#define S21C3                            BANKMASK(LCDDATA26), 5, b
#define S21C4                            BANKMASK(LCDDATA34), 5, b
#define S21C5                            BANKMASK(LCDDATA42), 5, b
#define S21C6                            BANKMASK(LCDDATA50), 5, b
#define S21C7                            BANKMASK(LCDDATA58), 5, b
#define S22C0                            BANKMASK(LCDDATA2), 6, b
#define S22C1                            BANKMASK(LCDDATA10), 6, b
#define S22C2                            BANKMASK(LCDDATA18), 6, b
#define S22C3                            BANKMASK(LCDDATA26), 6, b
#define S22C4                            BANKMASK(LCDDATA34), 6, b
#define S22C5                            BANKMASK(LCDDATA42), 6, b
#define S22C6                            BANKMASK(LCDDATA50), 6, b
#define S22C7                            BANKMASK(LCDDATA58), 6, b
#define S23C0                            BANKMASK(LCDDATA2), 7, b
#define S23C1                            BANKMASK(LCDDATA10), 7, b
#define S23C2                            BANKMASK(LCDDATA18), 7, b
#define S23C3                            BANKMASK(LCDDATA26), 7, b
#define S23C4                            BANKMASK(LCDDATA34), 7, b
#define S23C5                            BANKMASK(LCDDATA42), 7, b
#define S23C6                            BANKMASK(LCDDATA50), 7, b
#define S23C7                            BANKMASK(LCDDATA58), 7, b
#define S24C0                            BANKMASK(LCDDATA3), 0, b
#define S24C1                            BANKMASK(LCDDATA11), 0, b
#define S24C2                            BANKMASK(LCDDATA19), 0, b
#define S24C3                            BANKMASK(LCDDATA27), 0, b
#define S24C4                            BANKMASK(LCDDATA35), 0, b
#define S24C5                            BANKMASK(LCDDATA43), 0, b
#define S24C6                            BANKMASK(LCDDATA51), 0, b
#define S24C7                            BANKMASK(LCDDATA59), 0, b
#define S25C0                            BANKMASK(LCDDATA3), 1, b
#define S25C1                            BANKMASK(LCDDATA11), 1, b
#define S25C2                            BANKMASK(LCDDATA19), 1, b
#define S25C3                            BANKMASK(LCDDATA27), 1, b
#define S25C4                            BANKMASK(LCDDATA35), 1, b
#define S25C5                            BANKMASK(LCDDATA43), 1, b
#define S25C6                            BANKMASK(LCDDATA51), 1, b
#define S25C7                            BANKMASK(LCDDATA59), 1, b
#define S26C0                            BANKMASK(LCDDATA3), 2, b
#define S26C1                            BANKMASK(LCDDATA11), 2, b
#define S26C2                            BANKMASK(LCDDATA19), 2, b
#define S26C3                            BANKMASK(LCDDATA27), 2, b
#define S26C4                            BANKMASK(LCDDATA35), 2, b
#define S26C5                            BANKMASK(LCDDATA43), 2, b
#define S26C6                            BANKMASK(LCDDATA51), 2, b
#define S26C7                            BANKMASK(LCDDATA59), 2, b
#define S27C0                            BANKMASK(LCDDATA3), 3, b
#define S27C1                            BANKMASK(LCDDATA11), 3, b
#define S27C2                            BANKMASK(LCDDATA19), 3, b
#define S27C3                            BANKMASK(LCDDATA27), 3, b
#define S27C4                            BANKMASK(LCDDATA35), 3, b
#define S27C5                            BANKMASK(LCDDATA43), 3, b
#define S27C6                            BANKMASK(LCDDATA51), 3, b
#define S27C7                            BANKMASK(LCDDATA59), 3, b
#define S28C0                            BANKMASK(LCDDATA3), 4, b
#define S28C1                            BANKMASK(LCDDATA11), 4, b
#define S28C2                            BANKMASK(LCDDATA19), 4, b
#define S28C3                            BANKMASK(LCDDATA27), 4, b
#define S28C4                            BANKMASK(LCDDATA35), 4, b
#define S28C5                            BANKMASK(LCDDATA43), 4, b
#define S28C6                            BANKMASK(LCDDATA51), 4, b
#define S28C7                            BANKMASK(LCDDATA59), 4, b
#define S29C0                            BANKMASK(LCDDATA3), 5, b
#define S29C1                            BANKMASK(LCDDATA11), 5, b
#define S29C2                            BANKMASK(LCDDATA19), 5, b
#define S29C3                            BANKMASK(LCDDATA27), 5, b
#define S29C4                            BANKMASK(LCDDATA35), 5, b
#define S29C5                            BANKMASK(LCDDATA43), 5, b
#define S29C6                            BANKMASK(LCDDATA51), 5, b
#define S29C7                            BANKMASK(LCDDATA59), 5, b
#define S30C0                            BANKMASK(LCDDATA3), 6, b
#define S30C1                            BANKMASK(LCDDATA11), 6, b
#define S30C2                            BANKMASK(LCDDATA19), 6, b
#define S30C3                            BANKMASK(LCDDATA27), 6, b
#define S30C4                            BANKMASK(LCDDATA35), 6, b
#define S30C5                            BANKMASK(LCDDATA43), 6, b
#define S30C6                            BANKMASK(LCDDATA51), 6, b
#define S30C7                            BANKMASK(LCDDATA59), 6, b
#define S31C0                            BANKMASK(LCDDATA3), 7, b
#define S31C1                            BANKMASK(LCDDATA11), 7, b
#define S31C2                            BANKMASK(LCDDATA19), 7, b
#define S31C3                            BANKMASK(LCDDATA27), 7, b
#define S31C4                            BANKMASK(LCDDATA35), 7, b
#define S31C5                            BANKMASK(LCDDATA43), 7, b
#define S31C6                            BANKMASK(LCDDATA51), 7, b
#define S31C7                            BANKMASK(LCDDATA59), 7, b
#define S32C0                            BANKMASK(LCDDATA4), 0, b
#define S32C1                            BANKMASK(LCDDATA12), 0, b
#define S32C2                            BANKMASK(LCDDATA20), 0, b
#define S32C3                            BANKMASK(LCDDATA28), 0, b
#define S32C4                            BANKMASK(LCDDATA36), 0, b
#define S32C5                            BANKMASK(LCDDATA44), 0, b
#define S32C6                            BANKMASK(LCDDATA52), 0, b
#define S32C7                            BANKMASK(LCDDATA60), 0, b
#define S33C0                            BANKMASK(LCDDATA4), 1, b
#define S33C1                            BANKMASK(LCDDATA12), 1, b
#define S33C2                            BANKMASK(LCDDATA20), 1, b
#define S33C3                            BANKMASK(LCDDATA28), 1, b
#define S33C4                            BANKMASK(LCDDATA36), 1, b
#define S33C5                            BANKMASK(LCDDATA44), 1, b
#define S33C6                            BANKMASK(LCDDATA52), 1, b
#define S33C7                            BANKMASK(LCDDATA60), 1, b
#define S34C0                            BANKMASK(LCDDATA4), 2, b
#define S34C1                            BANKMASK(LCDDATA12), 2, b
#define S34C2                            BANKMASK(LCDDATA20), 2, b
#define S34C3                            BANKMASK(LCDDATA28), 2, b
#define S34C4                            BANKMASK(LCDDATA36), 2, b
#define S34C5                            BANKMASK(LCDDATA44), 2, b
#define S34C6                            BANKMASK(LCDDATA52), 2, b
#define S34C7                            BANKMASK(LCDDATA60), 2, b
#define S35C0                            BANKMASK(LCDDATA4), 3, b
#define S35C1                            BANKMASK(LCDDATA12), 3, b
#define S35C2                            BANKMASK(LCDDATA20), 3, b
#define S35C3                            BANKMASK(LCDDATA28), 3, b
#define S35C4                            BANKMASK(LCDDATA36), 3, b
#define S35C5                            BANKMASK(LCDDATA44), 3, b
#define S35C6                            BANKMASK(LCDDATA52), 3, b
#define S35C7                            BANKMASK(LCDDATA60), 3, b
#define S36C0                            BANKMASK(LCDDATA4), 4, b
#define S36C1                            BANKMASK(LCDDATA12), 4, b
#define S36C2                            BANKMASK(LCDDATA20), 4, b
#define S36C3                            BANKMASK(LCDDATA28), 4, b
#define S36C4                            BANKMASK(LCDDATA36), 4, b
#define S36C5                            BANKMASK(LCDDATA44), 4, b
#define S36C6                            BANKMASK(LCDDATA52), 4, b
#define S36C7                            BANKMASK(LCDDATA60), 4, b
#define S37C0                            BANKMASK(LCDDATA4), 5, b
#define S37C1                            BANKMASK(LCDDATA12), 5, b
#define S37C2                            BANKMASK(LCDDATA20), 5, b
#define S37C3                            BANKMASK(LCDDATA28), 5, b
#define S37C4                            BANKMASK(LCDDATA36), 5, b
#define S37C5                            BANKMASK(LCDDATA44), 5, b
#define S37C6                            BANKMASK(LCDDATA52), 5, b
#define S37C7                            BANKMASK(LCDDATA60), 5, b
#define S38C0                            BANKMASK(LCDDATA4), 6, b
#define S38C1                            BANKMASK(LCDDATA12), 6, b
#define S38C2                            BANKMASK(LCDDATA20), 6, b
#define S38C3                            BANKMASK(LCDDATA28), 6, b
#define S38C4                            BANKMASK(LCDDATA36), 6, b
#define S38C5                            BANKMASK(LCDDATA44), 6, b
#define S38C6                            BANKMASK(LCDDATA52), 6, b
#define S38C7                            BANKMASK(LCDDATA60), 6, b
#define S39C0                            BANKMASK(LCDDATA4), 7, b
#define S39C1                            BANKMASK(LCDDATA12), 7, b
#define S39C2                            BANKMASK(LCDDATA20), 7, b
#define S39C3                            BANKMASK(LCDDATA28), 7, b
#define S39C4                            BANKMASK(LCDDATA36), 7, b
#define S39C5                            BANKMASK(LCDDATA44), 7, b
#define S39C6                            BANKMASK(LCDDATA52), 7, b
#define S39C7                            BANKMASK(LCDDATA60), 7, b
#define S40C0                            BANKMASK(LCDDATA5), 0, b
#define S40C1                            BANKMASK(LCDDATA13), 0, b
#define S40C15                           BANKMASK(LCDDATA5), 0, b
#define S40C2                            BANKMASK(LCDDATA21), 0, b
#define S40C3                            BANKMASK(LCDDATA29), 0, b
#define S40C4                            BANKMASK(LCDDATA37), 0, b
#define S40C5                            BANKMASK(LCDDATA45), 0, b
#define S40C6                            BANKMASK(LCDDATA53), 0, b
#define S40C7                            BANKMASK(LCDDATA61), 0, b
#define S41C0                            BANKMASK(LCDDATA5), 1, b
#define S41C1                            BANKMASK(LCDDATA13), 1, b
#define S41C2                            BANKMASK(LCDDATA21), 1, b
#define S41C3                            BANKMASK(LCDDATA29), 1, b
#define S41C4                            BANKMASK(LCDDATA37), 1, b
#define S41C5                            BANKMASK(LCDDATA45), 1, b
#define S41C6                            BANKMASK(LCDDATA53), 1, b
#define S41C7                            BANKMASK(LCDDATA61), 1, b
#define S42C0                            BANKMASK(LCDDATA5), 2, b
#define S42C1                            BANKMASK(LCDDATA13), 2, b
#define S42C2                            BANKMASK(LCDDATA21), 2, b
#define S42C3                            BANKMASK(LCDDATA29), 2, b
#define S42C4                            BANKMASK(LCDDATA37), 2, b
#define S42C5                            BANKMASK(LCDDATA45), 2, b
#define S42C6                            BANKMASK(LCDDATA53), 2, b
#define S42C7                            BANKMASK(LCDDATA61), 2, b
#define S43C0                            BANKMASK(LCDDATA5), 3, b
#define S43C1                            BANKMASK(LCDDATA13), 3, b
#define S43C2                            BANKMASK(LCDDATA21), 3, b
#define S43C3                            BANKMASK(LCDDATA29), 3, b
#define S43C4                            BANKMASK(LCDDATA37), 3, b
#define S43C5                            BANKMASK(LCDDATA45), 3, b
#define S43C6                            BANKMASK(LCDDATA53), 3, b
#define S43C7                            BANKMASK(LCDDATA61), 3, b
#define S44C0                            BANKMASK(LCDDATA5), 4, b
#define S44C1                            BANKMASK(LCDDATA13), 4, b
#define S44C2                            BANKMASK(LCDDATA21), 4, b
#define S44C3                            BANKMASK(LCDDATA29), 4, b
#define S44C4                            BANKMASK(LCDDATA37), 4, b
#define S44C5                            BANKMASK(LCDDATA45), 4, b
#define S44C6                            BANKMASK(LCDDATA53), 4, b
#define S44C7                            BANKMASK(LCDDATA61), 4, b
#define S45C0                            BANKMASK(LCDDATA5), 5, b
#define S45C1                            BANKMASK(LCDDATA13), 5, b
#define S45C2                            BANKMASK(LCDDATA21), 5, b
#define S45C3                            BANKMASK(LCDDATA29), 5, b
#define S45C4                            BANKMASK(LCDDATA37), 5, b
#define S45C5                            BANKMASK(LCDDATA45), 5, b
#define S45C6                            BANKMASK(LCDDATA53), 5, b
#define S45C7                            BANKMASK(LCDDATA61), 5, b
#define S46C0                            BANKMASK(LCDDATA5), 6, b
#define S46C1                            BANKMASK(LCDDATA13), 6, b
#define S46C2                            BANKMASK(LCDDATA21), 6, b
#define S46C3                            BANKMASK(LCDDATA29), 6, b
#define S46C4                            BANKMASK(LCDDATA37), 6, b
#define S46C5                            BANKMASK(LCDDATA45), 6, b
#define S46C6                            BANKMASK(LCDDATA53), 6, b
#define S46C7                            BANKMASK(LCDDATA61), 6, b
#define S47C0                            BANKMASK(LCDDATA5), 7, b
#define S47C1                            BANKMASK(LCDDATA13), 7, b
#define S47C2                            BANKMASK(LCDDATA21), 7, b
#define S47C3                            BANKMASK(LCDDATA29), 7, b
#define S47C4                            BANKMASK(LCDDATA37), 7, b
#define S47C5                            BANKMASK(LCDDATA45), 7, b
#define S47C6                            BANKMASK(LCDDATA53), 7, b
#define S47C7                            BANKMASK(LCDDATA61), 7, b
#define S48C0                            BANKMASK(LCDDATA6), 0, b
#define S48C1                            BANKMASK(LCDDATA14), 0, b
#define S48C2                            BANKMASK(LCDDATA22), 0, b
#define S48C3                            BANKMASK(LCDDATA30), 0, b
#define S48C4                            BANKMASK(LCDDATA38), 0, b
#define S48C5                            BANKMASK(LCDDATA46), 0, b
#define S48C6                            BANKMASK(LCDDATA54), 0, b
#define S48C7                            BANKMASK(LCDDATA62), 0, b
#define S49C0                            BANKMASK(LCDDATA6), 1, b
#define S49C1                            BANKMASK(LCDDATA14), 1, b
#define S49C2                            BANKMASK(LCDDATA22), 1, b
#define S49C3                            BANKMASK(LCDDATA30), 1, b
#define S49C4                            BANKMASK(LCDDATA38), 1, b
#define S49C5                            BANKMASK(LCDDATA46), 1, b
#define S49C6                            BANKMASK(LCDDATA54), 1, b
#define S49C7                            BANKMASK(LCDDATA62), 1, b
#define S50C0                            BANKMASK(LCDDATA6), 2, b
#define S50C1                            BANKMASK(LCDDATA14), 2, b
#define S50C2                            BANKMASK(LCDDATA22), 2, b
#define S50C3                            BANKMASK(LCDDATA30), 2, b
#define S50C4                            BANKMASK(LCDDATA38), 2, b
#define S50C5                            BANKMASK(LCDDATA46), 2, b
#define S50C6                            BANKMASK(LCDDATA54), 2, b
#define S50C7                            BANKMASK(LCDDATA62), 2, b
#define S51C0                            BANKMASK(LCDDATA6), 3, b
#define S51C1                            BANKMASK(LCDDATA14), 3, b
#define S51C2                            BANKMASK(LCDDATA22), 3, b
#define S51C3                            BANKMASK(LCDDATA30), 3, b
#define S51C4                            BANKMASK(LCDDATA38), 3, b
#define S51C5                            BANKMASK(LCDDATA46), 3, b
#define S51C6                            BANKMASK(LCDDATA54), 3, b
#define S51C7                            BANKMASK(LCDDATA62), 3, b
#define S52C0                            BANKMASK(LCDDATA6), 4, b
#define S52C1                            BANKMASK(LCDDATA14), 4, b
#define S52C2                            BANKMASK(LCDDATA22), 4, b
#define S52C3                            BANKMASK(LCDDATA30), 4, b
#define S52C4                            BANKMASK(LCDDATA38), 4, b
#define S52C5                            BANKMASK(LCDDATA46), 4, b
#define S52C6                            BANKMASK(LCDDATA54), 4, b
#define S52C7                            BANKMASK(LCDDATA62), 4, b
#define S53C0                            BANKMASK(LCDDATA6), 5, b
#define S53C1                            BANKMASK(LCDDATA14), 5, b
#define S53C2                            BANKMASK(LCDDATA22), 5, b
#define S53C3                            BANKMASK(LCDDATA30), 5, b
#define S53C4                            BANKMASK(LCDDATA38), 5, b
#define S53C5                            BANKMASK(LCDDATA46), 5, b
#define S53C6                            BANKMASK(LCDDATA54), 5, b
#define S53C7                            BANKMASK(LCDDATA62), 5, b
#define S54C0                            BANKMASK(LCDDATA6), 6, b
#define S54C1                            BANKMASK(LCDDATA14), 6, b
#define S54C2                            BANKMASK(LCDDATA22), 6, b
#define S54C3                            BANKMASK(LCDDATA30), 6, b
#define S54C4                            BANKMASK(LCDDATA38), 6, b
#define S54C5                            BANKMASK(LCDDATA46), 6, b
#define S54C6                            BANKMASK(LCDDATA54), 6, b
#define S54C7                            BANKMASK(LCDDATA62), 6, b
#define S55C0                            BANKMASK(LCDDATA6), 7, b
#define S55C1                            BANKMASK(LCDDATA14), 7, b
#define S55C2                            BANKMASK(LCDDATA22), 7, b
#define S55C3                            BANKMASK(LCDDATA30), 7, b
#define S55C4                            BANKMASK(LCDDATA38), 7, b
#define S55C5                            BANKMASK(LCDDATA46), 7, b
#define S55C6                            BANKMASK(LCDDATA54), 7, b
#define S55C7                            BANKMASK(LCDDATA62), 7, b
#define S56C0                            BANKMASK(LCDDATA7), 0, b
#define S56C1                            BANKMASK(LCDDATA15), 0, b
#define S56C2                            BANKMASK(LCDDATA23), 0, b
#define S56C3                            BANKMASK(LCDDATA31), 0, b
#define S56C4                            BANKMASK(LCDDATA39), 0, b
#define S56C5                            BANKMASK(LCDDATA47), 0, b
#define S56C6                            BANKMASK(LCDDATA55), 0, b
#define S56C7                            BANKMASK(LCDDATA63), 0, b
#define S57C0                            BANKMASK(LCDDATA7), 1, b
#define S57C1                            BANKMASK(LCDDATA15), 1, b
#define S57C2                            BANKMASK(LCDDATA23), 1, b
#define S57C3                            BANKMASK(LCDDATA31), 1, b
#define S57C4                            BANKMASK(LCDDATA39), 1, b
#define S57C5                            BANKMASK(LCDDATA47), 1, b
#define S57C6                            BANKMASK(LCDDATA55), 1, b
#define S57C7                            BANKMASK(LCDDATA63), 1, b
#define S58C0                            BANKMASK(LCDDATA7), 2, b
#define S58C1                            BANKMASK(LCDDATA15), 2, b
#define S58C2                            BANKMASK(LCDDATA23), 2, b
#define S58C3                            BANKMASK(LCDDATA31), 2, b
#define S58C4                            BANKMASK(LCDDATA39), 2, b
#define S58C5                            BANKMASK(LCDDATA47), 2, b
#define S58C6                            BANKMASK(LCDDATA55), 2, b
#define S58C7                            BANKMASK(LCDDATA63), 2, b
#define S59C0                            BANKMASK(LCDDATA7), 3, b
#define S59C1                            BANKMASK(LCDDATA15), 3, b
#define S59C2                            BANKMASK(LCDDATA23), 3, b
#define S59C3                            BANKMASK(LCDDATA31), 3, b
#define S59C4                            BANKMASK(LCDDATA39), 3, b
#define S59C5                            BANKMASK(LCDDATA47), 3, b
#define S59C6                            BANKMASK(LCDDATA55), 3, b
#define S59C7                            BANKMASK(LCDDATA63), 3, b
#define S60C0                            BANKMASK(LCDDATA7), 4, b
#define S60C1                            BANKMASK(LCDDATA15), 4, b
#define S60C2                            BANKMASK(LCDDATA23), 4, b
#define S60C3                            BANKMASK(LCDDATA31), 4, b
#define S60C4                            BANKMASK(LCDDATA39), 4, b
#define S60C5                            BANKMASK(LCDDATA47), 4, b
#define S60C6                            BANKMASK(LCDDATA55), 4, b
#define S60C7                            BANKMASK(LCDDATA63), 4, b
